Revit 2027 API
StairsType.EndConnectionType Property
 The join style between a run and landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StairsEndConnectionType EndConnectionType { get; set; }
Public Property EndConnectionType As StairsEndConnectionType
	Get
	Set
public:
property StairsEndConnectionType EndConnectionType {
	StairsEndConnectionType get ();
	void set (StairsEndConnectionType value);
}
member EndConnectionType : StairsEndConnectionType with get, set
Property Value
StairsEndConnectionType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace